In [4]:
import pandas as pd

**1. From Python Lists**

In [21]:
data = [
["Alice", 25],
["Bob", 30],
["Charlie", 35],
["Michael", 24]
]

df = pd.DataFrame(data, columns=["Name", "Age"])
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3  Michael   24

**2. From DIctionary of List**

In [22]:
data = {
"Name": ["Alice", "Bob", "Charlie", "Michael"],
"Age": [25, 30, 35, 24]
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3  Michael   24

**3. From Numpy Arrays**

In [23]:
import numpy as np
data = np.array([[1,2,3], [4,5,6]])
df = pd.DataFrame(data, columns=["A", "B", "C"])
df

   A  B  C
0  1  2  3
1  4  5  6

**4. Read Excel Files**

In [20]:
df = pd.read_excel("data.xlsx")
df

     Name of Students                                 College  CGPA
0         Aarav Mehta                              IIT Bombay  9.10
1        Priya Sharma                        Delhi University  8.70
2         Rohan Gupta                             BITS Pilani  9.30
3          Sneha Iyer                         Anna University  8.50
4         Karan Patel                              NIT Trichy  8.90
5        Ananya Verma                     Jadavpur University  9.00
6        Aditya Joshi                         Pune University  8.60
7       Neha Kulkarni      Symbiosis International University  8.80
8         Vivek Singh                Banaras Hindu University  9.20
9          Meera Nair                       Christ University  8.40
10     Rahul Deshmukh        Savitribai Phule Pune University  8.70
11       Tanya Kapoor                        Amity University  8.30
12      Siddharth Rao   SRM Institute of Science & Technology  8.90
13       Pooja Mishra                    Jamia Millia Islamia  8.50
14        Arjun Reddy                      Osmania University  8.60
15         Kavya Jain                       Mumbai University  9.00
16       Manish Kumar          Lovely Professional University  8.20
17    Shreya Banerjee                   Presidency University  8.70
18       Deepak Yadav                   Chandigarh University  8.40
19  Bhavesh Chandwani  Chhatrapati Shivaji Maharaj University  8.68

**5. Read csv files.**

In [24]:
df = pd.read_csv("data.csv")
df

     Name of Students                                 College  CGPA
0         Aarav Mehta                              IIT Bombay  9.10
1        Priya Sharma                        Delhi University  8.70
2         Rohan Gupta                             BITS Pilani  9.30
3          Sneha Iyer                         Anna University  8.50
4         Karan Patel                              NIT Trichy  8.90
5        Ananya Verma                     Jadavpur University  9.00
6        Aditya Joshi                         Pune University  8.60
7       Neha Kulkarni      Symbiosis International University  8.80
8         Vivek Singh                Banaras Hindu University  9.20
9          Meera Nair                       Christ University  8.40
10     Rahul Deshmukh        Savitribai Phule Pune University  8.70
11       Tanya Kapoor                        Amity University  8.30
12      Siddharth Rao   SRM Institute of Science & Technology  8.90
13       Pooja Mishra                    Jamia Millia Islamia  8.50
14        Arjun Reddy                      Osmania University  8.60
15         Kavya Jain                       Mumbai University  9.00
16       Manish Kumar          Lovely Professional University  8.20
17    Shreya Banerjee                   Presidency University  8.70
18       Deepak Yadav                   Chandigarh University  8.40
19  Bhavesh Chandwani  Chhatrapati Shivaji Maharaj University  8.68

**6. From Json File**

In [25]:
df = pd.read_json("data.json")
df

     Name of Students                                 College  CGPA
0         Aarav Mehta                              IIT Bombay  9.10
1        Priya Sharma                        Delhi University  8.70
2         Rohan Gupta                             BITS Pilani  9.30
3          Sneha Iyer                         Anna University  8.50
4         Karan Patel                              NIT Trichy  8.90
5        Ananya Verma                     Jadavpur University  9.00
6        Aditya Joshi                         Pune University  8.60
7       Neha Kulkarni      Symbiosis International University  8.80
8         Vivek Singh                Banaras Hindu University  9.20
9          Meera Nair                       Christ University  8.40
10     Rahul Deshmukh        Savitribai Phule Pune University  8.70
11       Tanya Kapoor                        Amity University  8.30
12      Siddharth Rao   SRM Institute of Science & Technology  8.90
13       Pooja Mishra                    Jamia Millia Islamia  8.50
14        Arjun Reddy                      Osmania University  8.60
15         Kavya Jain                       Mumbai University  9.00
16       Manish Kumar          Lovely Professional University  8.20
17    Shreya Banerjee                   Presidency University  8.70
18       Deepak Yadav                   Chandigarh University  8.40
19  Bhavesh Chandwani  Chhatrapati Shivaji Maharaj University  8.68

**7. Read CSV from URL**

In [27]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [29]:
# Performing Exploratory Data Analysis (EDA).
df.head()       #Provide the first 5 rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [33]:
df.tail()     #Provide the last 5 rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [36]:
df.describe()   #Stats for numerical column

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [38]:
df.columns    # List of column names

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [39]:
df.shape      # rows, columns

(244, 7)